
def area(a):
    '''
    Возвращает площадь квадрата по заданной стороне.

        Параметры:
                a (int) или (float) - сторона квадрата.

        Возвращает значение:
                area(a) - площадь квадрата с стороной a.
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по заданной стороне.

        Параметры:
                a (int) или (float) - сторона квадрата.

        Возвращает значение:
                area(a) - периметр квадрата с стороной a.
    '''
    return 4 * a
